SAGT/grn

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/scm/receiving/receiptsInterface/transactions/processorServiceV2/types/" xmlns:proc="http://xmlns.oracle.com/apps/scm/receiving/receiptsInterface/transactions/processorServiceV2/">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:processor>
         <!--Zero or more repetitions:-->
         <typ:Receipt>
            <proc:ASNType>STD</proc:ASNType>
            <proc:TransactionType>NEW</proc:TransactionType>
            <proc:BusinessUnit>Demo SAGT BU2</proc:BusinessUnit>
            <proc:ReceiptSourceCode>VENDOR</proc:ReceiptSourceCode>
            <proc:TransactionDate>2018-10-05T00:00:00.000</proc:TransactionDate>
            <proc:EmployeeId>300000001593344</proc:EmployeeId>
proc:EmployeeName>
            <proc:LocationId>300000001610352</proc:LocationId>
            <!--Zero or more repetitions:-->
            <proc:StagedReceivingTransaction>
            	<proc:ReceiptSourceCode>VENDOR</proc:ReceiptSourceCode>
               <proc:AutoTransactCode>RECEIVE</proc:AutoTransactCode>
               <proc:CurrencyCode>USD</proc:CurrencyCode>
               <proc:DocumentLineNumber>1</proc:DocumentLineNumber>
               <proc:POHeaderId>7001</proc:POHeaderId>
               <proc:DocumentShipmentLineNumber>1</proc:DocumentShipmentLineNumber>
               <proc:ItemNumber>Chair</proc:ItemNumber>
               <proc:SoldtoLegalEntity>Demo SAGT Legal Entity2</proc:SoldtoLegalEntity>
               <proc:SourceDocumentCode>PO</proc:SourceDocumentCode>
               <proc:ToOrganizationId>300000001610391</proc:ToOrganizationId>
               <proc:TransactionDate>2018-10-05T00:00:00.000</proc:TransactionDate>
               <proc:TransactionType>RECEIVE</proc:TransactionType>
               <proc:Quantity unitCode="">1</proc:Quantity>
               <proc:UnitOfMeasure>Each</proc:UnitOfMeasure>
               <proc:VendorName>Arpico Furniture</proc:VendorName>

               <proc:CurrencyConversionDate>2018-10-05T00:00:00.000</proc:CurrencyConversionDate>
            </proc:StagedReceivingTransaction>
         </typ:Receipt>
      </typ:processor>
   </soapenv:Body>
</soapenv:Envelope>